classes/subclasses/rebel.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-11 Mon 19:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rebel</title>
<meta name="author" content="zfoteff" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../static/stylesheets/subclass-style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Rebel</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8adbf85">1. Rebel Traits</a></li>
<li><a href="#orgcff18ed">2. Level 1</a></li>
<li><a href="#org60d41cc">3. Level 2 (5+)</a></li>
<li><a href="#orgab2e3d1">4. Level 3 (11+)</a></li>
<li><a href="#org1dcedb4">5. Level 4 (15+)</a></li>
</ul>
</div>
</div>
<div class="org-center">
<p>
[<a href="../../dnd.html#ID-7d419730-2064-41f9-80ee-f24ed9b01ac7">Main Menu</a>] [<a href="../classes.html#ID-69ef1740-156a-4e42-9493-49ec80a4ac26">Classes</a>] [<a href="../warrior.html#ID-1846aace-7d40-41af-95e6-4a4d72044af5">Warrior</a>]
</p>
</div>
<hr />
<p>
Fight the power. Front line soldier empowered with the revolutionary spirit.
</p>
<div id="outline-container-org8adbf85" class="outline-2">
<h2 id="org8adbf85"><span class="section-number-2">1.</span> Rebel Traits</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><span class="underline"><i>Opportunist</i></span>: When participating in a riot, uprising, coup, assassination attempt, or other disturbance of normal civic activity, you deal 50% extra damage.</li>
<li><span class="underline"><i>Escape Artist</i></span>: You can escape from all non-magical bindings while avoiding all detection.</li>
</ul>
</div>
</div>
<div id="outline-container-orgcff18ed" class="outline-2">
<h2 id="orgcff18ed"><span class="section-number-2">2.</span> Level 1</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><span class="underline"><b>Idealist</b></span>: Stand by your convictions and raise your attack</li>
<li><span class="underline"><b>Brave</b></span>: You gain advantage on saving throws against being frightened or intimidated</li>
<li><span class="underline"><b>Rhetoric</b></span>: You can learn another language and you gain +2 to your persuasion skill.</li>
</ul>
</div>
</div>
<div id="outline-container-org60d41cc" class="outline-2">
<h2 id="org60d41cc"><span class="section-number-2">3.</span> Level 2 (5+)</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><span class="underline"><b>Underdog</b></span> Once per long rest, increase your parties hit rolls by +3</li>
<li><span class="underline"><b>Camaraderie</b></span>: You make a 1-minute speech or other display of camaraderie. Any allied creature that can see or hear you gains a number of temporary hit points equal to 1d8 + your Charisma modifier.</li>
</ul>
</div>
</div>
<div id="outline-container-orgab2e3d1" class="outline-2">
<h2 id="orgab2e3d1"><span class="section-number-2">4.</span> Level 3 (11+)</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><span class="underline"><b>Guerrilla Warfare</b></span>: If your party is all undetected before ambushing an enemy or group of enemies, all targets will have the shocked debuff applied to them for the duration of the combat encounter.</li>
<li><span class="underline"><b>Coordinated Strike</b></span>: Once every long rest, when your character attacks an allied creature within 30ft can also attack in the same turn.</li>
<li><span class="underline"><b>Ringleader</b></span>: Your renown and ideology are widespread. If there are creatures friendly to your revolutionary ideology in a populated area, you can spend 8 hours gathering rumors and following leads to find a dedicated espionage agent.</li>
</ul>
</div>
</div>
<div id="outline-container-org1dcedb4" class="outline-2">
<h2 id="org1dcedb4"><span class="section-number-2">5.</span> Level 4 (15+)</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><span class="underline"><b>Rebel Leader</b></span>: You become immune to magic that can detect your thoughts or emotions, unless you choose to be affected. You also can communicate telepathically with a creature with whom you share a soul covenant with at any distance on the same plane of existence.</li>
</ul>
<hr />
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-08-11 Fri 00:00</p>
<p class="author">Author: zfoteff</p>
<p class="date">Created: 2023-09-11 Mon 19:47</p>
</div>
</body>
</html>